{"t":"Minirogue","stats":{"hp":{"t":"Здоровье","img":"icon-hp"},"lvl":{"t":"Уровень","img":"icon-lvl"},"exp":{"t":"Опыт","img":"icon-exp"},"item-lvl":{"t":"Уровень предмета","img":"icon-item-lvl"},"success":{"t":"Успех!"},"fail":{"t":"Провал.."}},"locations":{"chooseDifficulty":{"t":"Minirogue - игра на выживание в мрачном фэнтези-мире со стратегическим походовым игровым процессом в виде интерактивной книги","d":"Исследовать мир вы сможете так, как нравится вам. Следовать сюжету, развивать героя, исследовать секреты этого мира. Конфликты вы можете разрешить при помощи дипломатии, незаметности, убийства, охоты и десятков других способов, благодаря вещам доступным герою и вашему мировоззрению. Сражение – далеко не единственный метод! Выбирайте свой стиль игры и выясните главный секрет мира Minirogue!","actions":["easyStart"]},"ObjectMirror":{"t":"ОПК 'Зеркало'","d":"Монументальное сооружение в толще скалы, надежно скрытое от глаз посторонних людей. Вероятно, это храм какого-то могучего божества, так его магическое присутствие ощущается отовсюду в этих залах.. В центральном, наиболее крупном помещении, по всей видимости, какой-то алтарь. В иных каморах алхимические приборы и ритуальные инструменты. Некоторые стены испещрены разноцветными нитями-веревками, от самых стен исходит гул и то и дело вспыхивают зеленые огоньки. Все эти непонятные вещи пугают, но в глубине души, вы чувствуете, что в этом нет никакой угрозы. Выход из сооружения преграждает сетчатое заграждение и дверь со светящей табличкой рядом. Можно попробовать разобраться с этим механизмом, или просто сломать его чем-нибудь тяжелым.","actions":["investigateObjectMirror","breakTheDoorObjectMirror","hackTheDoorObjectMirror"]},"Village":{"t":"Подгорное","d":"Село находящееся неподалеку от горного комплекса. Местные промышляют охотой и земледелием. \n\t\t\t\t\tЖизнь здесь течет спокойно, размеренно, жители неторопясь занимаются своими делам и не обращают на вас никакого внимания. \n\t\t\t\t\tПрисмотревшись вы замечаете, что в скромном быту местные используют фрагменты разрушенного периметра у Горы. \n\t\t\t\t\tПредприятие это, надо заметить, рисковое. Искатели то и дело гибнут, или остаются калеками натыкаясь на кошмарных механических людей\n\t\t\t\t\tв руинах сооружений прилегающих к Горе.","actions":["quest-00-01","talkAboutObjectMirrorInVillage","workInVillage","huntInVillage","buyWeapon05InVillage","buySupply01InVillage","buyArmor01InVillage","toMirrorRuins","toWasteland"]},"MirrorRuins":{"t":"Подсобные сооружения ОПК 'Зеркало'","d":"Руины окружающие грандиозный комплекс в скале. Местные не имеют представления о назначении этих сооружений, \n\t\t\t\t\tа потому вольны думать все, что угодно в рамках своего мировоззрения. Согласно общему мнению, это проклятое место когда-то\n\t\t\t\t\tиспользовалось злыми людьми для омерзительных кровавых ритуалов, а потому было разрушено до основания. \n\t\t\t\t\tОднако как и подобает подобным местам стало пристанищем для неупокоенных душ, кои все никак не могут позволить \n\t\t\t\t\tместным растащить все до последнего кирпичика. Практически каждый искатель из села стал свидетелем гибели друга \n\t\t\t\t\tили знакомого от рук жутких тварей, похожих на кукол с человеческий рост.","actions":["toVillage","investigateMirrorRuins","hardHuntInMirrorRuins","easyHuntInMirrorRuins","quest-00-02"]},"Wasteland":{"t":"Южная пустошь","d":"Обширная степь, тянется далеко на юг от Горы. Не смотря на кажущуюся пустоту, здесь кипит жизнь. Снуют 'корованы', на которые\n\t\t\t\t\tпорой набегает местная рвань. Старатели выискивают рудные жилы, а опытные охотники то и дело устравают рейды на диких степняков.","actions":["toVillage"]}},"actions":{"heroRest":{"t":"Перекусить","hide":true,"itemTypes":[{"id":"supply","lvl":1,"qty":1}],"success":{"d":"Вы перекусили и немного вздремнули","hp":2,"exp":5},"img":"icon-rest"},"heroRest2":{"t":"Обработать раны","hide":true,"itemTypes":[{"id":"supply","lvl":2,"qty":1}],"success":{"d":"Вы хорошенько обработали свои раны","hp":5,"exp":15},"img":"icon-alchemy"},"easyStart":{"t":"Ну, поехали!","success":{"d":"Вы обнаружили себя в абсолютной темноте. Все, что вы помните о себе, это смутные воспоминания вашего похищения. \n\t\t\t\t\t\tКажется, за вашу голову была назначена награда. Надо найти дорогу домой.","locId":"ObjectMirror","questId":"quest-00","items":[{"id":"armor01","qty":2},{"id":"supply02","qty":1}]}},"investigateObjectMirror":{"t":"Обыскать сооружение","lvl":2,"success":{"d":"Вам удалось найти немного хлама, однако в темноте вы то и дело натыкались на битое стекло и твердые предметы.","exp":10,"hp":-1,"items":[{"id":"armor01","maxQty":1},{"id":"weapon01","maxQty":1},{"id":"supply01","maxQty":1}]},"fail":{"d":"Пару раз споткнувшись и крепко приложившись головой, вы решаете, что бродить в полутьме не лучшая идея","exp":5,"hp":-1,"items":[{"id":"weapon01","maxQty":1}]},"img":"icon-loot"},"breakTheDoorObjectMirror":{"t":"Выломать дверь","lvl":2,"itemTypes":[{"id":"weapon","lvl":1,"qty":1}],"success":{"d":"Прежде чем ломать вы внимательно осмотрели дверь. И как оказалось не зря, так как стало очевидно, что достаточно разбить замок странного вида. Вероятно он держал дверь при помощи какой-то магии, так как не было никакого засова. Покинув объект вы направились к ближайшему поселению.","exp":10,"locId":"Village"},"fail":{"d":"Приложив немного усилий вы смогли выломать кусок двери, когда обнаружили, что дверь была зафиксирована замком в верхней части, вероятно проще было бы сломать именно его, а не саму дверь. Ломая дверь вы поранились жестяной обивкой. Покинув объект вы направились к ближайшему поселению.","exp":5,"hp":-1,"locId":"Village"},"img":"icon-strength"},"hackTheDoorObjectMirror":{"t":"Попытаться открыть замок","lvl":4,"success":{"d":"Осмотрев дверь и замок вы пришли к выводу, что это какой-то механизм. Вы набрали цифры нацарапанные на стене, и издав писк дверь открылась. Покинув объект вы направились к ближайшему поселению.","exp":50,"locId":"Village"},"fail":{"d":"Осмотрев дверь и замок, вы так и не поняли, что с этим делать. От тяжких раздумий вы проголодались.","exp":5,"hp":-1},"img":"icon-planning"},"quest-00-01":{"t":"Познакомиться с местными","lvl":3,"questId":"quest-00","success":{"d":"Вам удалось найти группу селян праздно обсуждающих что-то, и вмешаться в их разговор. \n\t\t\t\t\t\tПоздоровавшись, вы уточнили, не встречал ли вас кто-то раньше, на что все присутствующие отреагировали добрым хохотом. \n\t\t\t\t\t\tПовторив вопрос, вы сообщили, что ожидаете услышать ответ, а не развлекать публику. Один из мужиков, сказал, что вы уже \n\t\t\t\t\t\tкоторый раз приходите в село с этим вопросом, и посмеявшись добавил, что крайний раз вы заходили достаточно давно, \n\t\t\t\t\t\tс тех пор минуло около месяца. Вам посоветовали меньше налегать на медовуху и найти наконец себе бабу. \n\t\t\t\t\t\tСтановится очевидно, что вы не из этих мест, однако часто здесь бываете. Но как это возможно, и почему вы всякий раз этого не помните?","exp":5},"fail":{"d":"Местные жители все как один отмахиваются от вас, дескать у них нет времени на всякого рода убогих.\n\t\t\t\t\t\tНеприятно, но придется проявить настойчивость."},"img":"icon-talk"},"talkAboutObjectMirrorInVillage":{"t":"Расспросить про комплекс в скале","success":{"d":"Опрошенные селяне сходятся во мнении, что вы лжец, раз утверждаете, что пришли из горы. \n\t\t\t\t\t\tПо мнению местных, никакого входа внутрь не существует, ведь они не раз бывали там, и своими глазами видели, \n\t\t\t\t\t\tчто тоннель наглухо закрыт изнутри вратами из крепкого метала. Более того, даже приблизиться к комплексу \n\t\t\t\t\t\tвесьма проблематично, т.к. руины у горы кишат жуткими существами, от оружия которых нет никакой защиты.\n\t\t\t\t\t\tВозможно вам стоит поговорить с искателями, которые регулярно устраивают экспедиции в руины."},"img":"icon-talk"},"workInVillage":{"t":"Работать за еду","lvl":3,"success":{"d":"Вы смогли договориться о подработке с одной милой селянкой. Вдохновляясь её (селянки) аппетитными формами вы рвали редис так усердно, что забыли про время. Селяночка расстроилась, узнав, что вы не можете остаться, угостила вас своими сдобными булочками и просила обязательно вернуться.","exp":5,"items":[{"id":"supply01","qty":1,"maxQty":1}]},"fail":{"d":"Никто из крестьян не хотел брать вас на работу, ведь по общему мнению вы пьянчуга или того хуже, беглый разбойник. Наконец один мужик согласился дать вам работу. Целый день вы кололи и тоскали дрова, отчего к вечеру валились с ног. Мужик оценил ваш труд, и дал немного монет, разрешив переночевать в хлеву.","hp":-1,"exp":10,"items":[{"id":"money1","qty":3,"maxQty":6}]},"img":"icon-loc-forest"},"huntInVillage":{"t":"Охотиться","lvl":5,"itemTypes":[{"id":"weapon","lvl":1,"qty":1}],"success":{"d":"Вам удалось договориться с охотниками, за долю трофея вы отправились на охоту с местными. Вам повезло, уловив след, вы вскоре приблизилсь к жертве и метким выстрелом поразили животное в самое сердце. Охотники восхищены вашим умением, и выплатили вашу долю без колебаний.","exp":25,"items":[{"id":"money1","qty":10,"maxQty":15},{"id":"wood1","maxQty":2},{"id":"herbs1","maxQty":2}]},"fail":{"d":"Вам удалось договориться с охотниками, за долю трофея вы отправились на охоту с местными. Быстро напав на след, вы неразобравшись вышли на дикого кабана. Едва не погибнув вы все таки смогли одолеть животное. Хоть вы и вышли победителем из схватки, но ссадины и ушибы будут еще долго напоминать вам об этой встрече.","hp":-4,"exp":10,"items":[{"id":"money1","qty":10,"maxQty":15},{"id":"wood1","maxQty":2},{"id":"herbs1","maxQty":2}]},"img":"icon-hunt"},"buyWeapon05InVillage":{"t":"Купить оружие","itemTypes":[{"id":"money","lvl":1,"qty":15}],"success":{"d":"Поторговавшись, вы купили оружие","items":[{"id":"weapon02","qty":1}]},"img":"icon-buy-weapon"},"buySupply01InVillage":{"t":"Купить еду","itemTypes":[{"id":"money","lvl":1,"qty":10}],"success":{"d":"Поторговавшись, вы купили немного еды","items":[{"id":"supply01","qty":1,"maxQty":2}]},"img":"icon-buy-supply"},"buyArmor01InVillage":{"t":"Купить одежду","itemTypes":[{"id":"money","lvl":1,"qty":15}],"success":{"d":"Поторговавшись, вы купили комплект поношенной одежды","items":[{"id":"armor01","qty":1,"maxQty":1}]},"img":"icon-buy-armor"},"toMirrorRuins":{"t":"К руинам периметра","success":{"d":"Вы пришли к окраине леса, откуда хорошо видны руины комплекса","locId":"MirrorRuins"},"img":"icon-ruins"},"investigateMirrorRuins":{"t":"Искать ценности в руинах","lvl":5,"itemTypes":[{"id":"armor","lvl":1,"qty":1},{"id":"supply","lvl":1,"qty":1}],"success":{"d":"Пробравшись сквозь дебри леса к руинами сооружений, вы внимательно осмотрелись. Все чтобы было близко к лесу, \n\t\t\t\t\t\tместные давно растащили, а значит нужно идти вглубь, несмотря на высокую опасность. Перекусив, вы осторожно направились\n\t\t\t\t\t \tв руины. Сегодня вам повезло, набив  рюкзак полезным на вид хабаром, вы осторожно вернулись в лес. По возвращению, \n\t\t\t\t\t \tвам удалось выгодно продать утащенное местным.","exp":50,"items":[{"id":"money1","qty":15,"maxQty":35}]},"fail":{"d":"Приблизившись к руинам, вы осмотрелись. Не заметив никакой угрозы, вы выбрались из зарослей и направились\n\t\t\t\t\t\tк ближайшему сооружению по открытой поляне. Потеряв бдительность, вы не заметили, как во мраке руин из под груды бетонной\n\t\t\t\t\t\tкрошки резкими механическими движениями выбралось нечто, и жутко, словно кукла в руках неопытного кукловода устремилось\n\t\t\t\t\t\tнаперерез вам. Раздался треск очереди, и вы почувствовали резкий удар в области поясницы. Резко пригнувшись вам удалось\n\t\t\t\t\t    занять укрытие, зажимая руками открытую рану...","hp":-15},"img":"icon-skull"},"hardHuntInMirrorRuins":{"t":"Помочь искателям в зачистке","lvl":5,"itemTypes":[{"id":"armor","lvl":1,"qty":1}],"success":{"d":"Ваша группа выдвинулась к месту, где в последний раз был серьезно ранен один из искателей. Довольно скоро вы заметили\n\t\t\t\t\t\tмеханическое чудовище, которое неподвижно затаилось среди страительного хлама. Жребием был выбран тот, кто будет отвлекать опасность на себя.. \n\t\t\t\t\t\tВ конечном счете группе удалось заманить механизм в подготовленное место и обрушить на него стену. Одной угрозой меньше.","exp":75,"items":[{"id":"money1","qty":25,"maxQty":50}]},"fail":{"d":"С самого начала, все пошло не так. Едва группа приблизились к руинам, как начался обстрел сразу с нескольких направлений.\n\t\t\t\t\t\tВсе хаотично разбежались кто куда. Вам повезло, вы остались целы, однако проголодались и изодрали одежду и ноги о разбитый хлам.","hp":-2,"exp":5},"img":"icon-skull"},"easyHuntInMirrorRuins":{"t":"Рейдить роботов периметра","lvl":6,"itemTypes":[{"id":"weapon","lvl":4,"qty":1},{"id":"cell","lvl":2,"qty":2},{"id":"armor","lvl":4,"qty":1},{"id":"supply","lvl":1,"qty":1}],"success":{"d":"Приблизившись к руинам вы выждали появления искателей, что привлекло внимание одного робота. \n\t\t\t\t\t\tЕдва последний загрузил боевую программу и двинулся к недотепам, как вы точным выстрелами разрушили его сенсорную матрицу и элемент питания в задней части.\n\t\t\t\t\t\tИскатели были шокированы зрелищем и не решились приблизиться к вам, пока вы собирали трофеи с уничтоженного противника.","exp":150,"items":[{"id":"weapon4","maxQty":3},{"id":"armor4","maxQty":1},{"id":"cell2","qty":1,"maxQty":3}]},"fail":{"d":"Не встретив искателей, вам пришлось в одиночку выискивать роботов. К сожалению, робот обнаружил вас раньше, чем вы его.\n\t\t\t\t\t\tПолучив попадания в защиту, вам удалось быстро занять укрытие и меняя позиции эффективно поразить механизм. К тому моменту, когда вы закончили сбор трофеев,\n\t\t\t\t\t\tиз леса выдвинулась группа искателей. Вероятно, они специально переждали опасность подставив вас под удар.","hp":-5,"exp":150,"items":[{"id":"weapon4","maxQty":3},{"id":"armor4","maxQty":1},{"id":"cell2","qty":1,"maxQty":3}]},"img":"icon-skull"},"quest-00-02":{"t":"Расспросить искателей","lvl":5,"questId":"quest-00","success":{"d":"На привале, куда сходятся все искатели продать хабар и отдохнуть, вам удалось разговориться с одним из мужиков. С его слов выходит,\n\t\t\t\t\t\tчто комплекс был разрушен еще при жизни его отца, при чем никто не видел как именно это произошло, просто ночью были слышны взрывы, а по утру\n\t\t\t\t\t\tзнакомая по сей день картина. Историю этого места никто не знает, но руины до сих пор\n\t\t\t\t\t\tтщательно охраняются, что говорит об их ценности. Вас, как оказалось, знают все. Выходит, что вы довольно часто бываете в этих местах,\n\t\t\t\t\t\tи всякий раз ничего не помните. Тем не менее, мужик вспомнил, что у вас есть знакомый, такой же упоротый как и вы.\n\t\t\t\t\t\tЖивет на отшибе, редко приходит в село, на вас чем-то похож. Вам определенно стоит найти этого человека.","exp":50,"questId":"quest-01"},"fail":{"d":"Большинство искателей заняты подготовкой к очередной вылазке, и вежливо, почти благородно, направляют вас нахер.\n\t\t\t\t\t\tВы не остаетесь в долгу. От чего-то разговор не клеится, вероятно стоит попробовать снова."},"img":"icon-quest2"},"toVillage":{"t":"Отправиться в Подгорное","success":{"locId":"Village"},"img":"icon-village"},"donation":{"t":"Получить сладкий рулет!","success":{"d":"Торт это ложь, простите. Возьмите лучше пару блестяшек.","hp":100,"exp":1000,"items":[{"id":"gems","qty":2}]},"img":"icon-donation"},"craftWeapon01":{"t":"Изготовить дубину","lvl":3,"hide":true,"itemTypes":[{"id":"wood","lvl":1,"qty":1}],"success":{"d":"Вы выточили крепкую дубину","exp":10,"items":[{"id":"weapon01","qty":1}]},"fail":{"d":"Вы испортили материал","exp":5},"img":"icon-craft"},"craftSupply02":{"t":"Изготовить целебную мазь","lvl":5,"hide":true,"itemTypes":[{"id":"herbs","lvl":1,"qty":3}],"success":{"d":"Вы изготовили желаемое","exp":25,"items":[{"id":"supply02","qty":1}]},"fail":{"d":"Вы испортили материал","exp":5},"img":"icon-alchemy"},"toWasteland":{"t":"В южную пустошь","questId":"quest-01","success":{"d":"Вместе с группой охотников вы отправились в путь..","locId":"Wasteland"},"img":"icon-rest"}},"itemTypes":{"weapon":{"t":"Оружие","img":"icon-weapons"},"armor":{"t":"Броня","img":"icon-armors"},"magic":{"t":"Магия","img":"icon-magic"},"supply":{"t":"Припасы","img":"icon-supply"},"transport":{"t":"Транспорт","img":"icon-transport"},"money":{"t":"Деньги","img":"icon-money"},"wood":{"t":"Древесина","img":"icon-wood"},"metal":{"t":"Руда","img":"icon-metal"},"cloth":{"t":"Ткань","img":"icon-cloth"},"herbs":{"t":"Травы","img":"icon-herbs"},"leather":{"t":"Кожа","img":"icon-leather"},"cell":{"t":"Аккумуляторная батарея","img":"icon-cell"}},"items":{"weapon01":{"t":"Дубина","lvl":1,"itemType":"weapon","img":"icon-weapon01"},"weapon02":{"t":"Копье с медным наконечником","lvl":1,"itemType":"weapon","img":"icon-weapon02"},"weapon20":{"t":"Стальной меч","lvl":2,"itemType":"weapon","img":"icon-weapon20","q":"icon-qlt-low"},"weapon30":{"t":"Мастерский арбалет","lvl":3,"itemType":"weapon","img":"icon-weapon30","q":"icon-qlt-mid"},"weapon40":{"t":"Лазерный пистолет","lvl":4,"itemType":"weapon","img":"icon-weapon40","q":"icon-qlt-high"},"armor01":{"t":"Простая одежда","lvl":1,"itemType":"armor","img":"icon-armor01"},"armor02":{"t":"Железный нагрудник","lvl":2,"itemType":"armor","img":"icon-armor02","q":"icon-qlt-low"},"armor03":{"t":"Титановые латы","lvl":3,"itemType":"armor","img":"icon-armor03","q":"icon-qlt-mid"},"armor04":{"t":"Композитный бронежилет","lvl":4,"itemType":"armor","img":"icon-armor04","q":"icon-qlt-high"},"supply01":{"t":"Хлебушек","lvl":1,"itemType":"supply","img":"icon-supply01"},"supply02":{"t":"Целебная мазь","lvl":2,"itemType":"supply","img":"icon-supply02","q":"icon-qlt-low"},"supply03":{"t":"Зелье здоровья","lvl":3,"itemType":"supply","img":"icon-supply03","q":"icon-qlt-mid"},"supply04":{"t":"Ингибитор регенерации","lvl":4,"itemType":"supply","img":"icon-supply04","q":"icon-qlt-high"},"money1":{"t":"Монеты","lvl":1,"itemType":"money","img":"icon-money1"},"money2":{"t":"Самоцветы","lvl":100,"itemType":"money","img":"icon-money2","q":"icon-qlt-mid"},"money3":{"t":"Энергоячейка","lvl":1000,"itemType":"money","img":"icon-money3","q":"icon-qlt-high"},"transport3":{"t":"Корабль","lvl":3,"itemType":"transport","img":"icon-transport3","q":"icon-qlt-mid"},"transport4":{"t":"Вертокрыл","lvl":4,"itemType":"transport","img":"icon-transport4","q":"icon-qlt-high"},"magic":{"t":"Свиток","lvl":25,"itemType":"magic"},"magic2":{"t":"<span class='lbl-magic'>Магический камень<\/span>","lvl":50,"itemType":"magic","img":"icon-magic2"},"wood1":{"t":"Сосна","itemType":"wood","lvl":25,"img":"icon-wood1"},"wood2":{"t":"Дуб","itemType":"wood","lvl":50,"img":"icon-wood2","q":"icon-qlt-low"},"wood3":{"t":"Архидуб","itemType":"wood","lvl":75,"img":"icon-wood3","q":"icon-qlt-mid"},"wood4":{"t":"Драконово древо","itemType":"wood","lvl":100,"img":"icon-wood4","q":"icon-qlt-high"},"metal1":{"t":"Медь","itemType":"metal","lvl":1,"img":"icon-metal1"},"metal2":{"t":"Железо","itemType":"metal","lvl":2,"img":"icon-metal2","q":"icon-qlt-low"},"metal3":{"t":"Титанит","itemType":"metal","lvl":3,"img":"icon-metal3","q":"icon-qlt-mid"},"metal4":{"t":"Композитный полимер","itemType":"metal","lvl":4,"img":"icon-metal4","q":"icon-qlt-high"},"herbs1":{"t":"Подорожник","itemType":"herbs","lvl":1,"img":"icon-herbs1"},"cloth1":{"t":"Льненая ткань","itemType":"cloth","lvl":1,"img":"icon-cloth1"},"leather1":{"t":"Тонкая кожа","itemType":"leather","lvl":1,"img":"icon-leather1"},"cell2":{"t":"Цезиевый аккумулятор","itemType":"cell","lvl":2,"img":"icon-cell2"}},"quests":{"quest-00":{"t":"Память","d":"Нужно выяснить кто вы, и найти дорогу домой"},"quest-01":{"t":"Чертовщина","d":"Выяснилось, что у вас есть знакомый. Следует его найти и прояснить картину целиком."}}}